## SQL

In [ ]:
#structured query language

In [ ]:
#This is a std. database language used by all RDBMS(like Mysql, SQLserver, Oracle, Msaccess, Informix, Postgres)
#for storing, retrieving and manipulating the data from their databases.

In [ ]:
#In RDBMS data is stored in the from of tables:
  #Each field is a column in the table.
  #Each record is a row in the table.

In [ ]:
# SQl  Keywords are not case sensitive: select is same as SELECT.
  #but field names and data in the table cells is case sensitive.

## Select

In [ ]:
# select * from Table_name;

In [ ]:
# select col1, col2,...,coln from table_name;

In [ ]:
# select distinct coln from table_name;                   #it retrurns unique entries of coln

In [ ]:
# select distinct col1, col2, col3 from table_name;       # it will return all the records(only for col1,col2,col3) against the unique entries of col1

## Where Clause

In [ ]:
# select col1,col2,..,coln from table_name  where condition;

## Operators in where clause

In [ ]:
#SELECT * FROM Customers WHERE Country = 'Germany'
#SELECT * FROM Customers WHERE id=25

In [ ]:
#SELECT * FROM Customers WHERE Country<>'Mexico';

In [ ]:
#SELECT * FROM Products WHERE Price > 30;
#SELECT * FROM Products WHERE Price < 100;

In [ ]:
#SELECT * FROM Products WHERE Price <= 50;
#SELECT * FROM Products WHERE Price >= 50;

In [ ]:
#SELECT * FROM Products WHERE Price BETWEEN 50 AND 60;                       #selects values within a given range.
#SELECT * FROM Products WHERE Price not BETWEEN 50 AND 60;

In [ ]:
#SELECT * FROM Customers where City in ('London','Lille','Sevilla')             #for string matching
#SELECT * FROM Customers where City not in ('London','Lille','Sevilla')

#SELECT ProductName, Price FROM Products WHERE Price in (10 , 20,30)            #for numeric values

In [ ]:
# SELECT * FROM Customers WHERE City LIKE 'f%';                              #used to search for a specified pattern in a column.
# SELECT * FROM Customers WHERE City LIKE '%i%';
# SELECT * FROM Customers WHERE City LIKE '_u%';

### WildCards

In [ ]:
# '%'     zero,one or more characters
#SELECT * FROM Customers WHERE City LIKE '%es%';

In [ ]:
# '_' a single character
#SELECT * FROM Customers WHERE City LIKE 'L_n_on';

In [ ]:
#'[]' any single character within the brackets
#SELECT * FROM Customers WHERE City LIKE '[lbs]%';

In [ ]:
#'[-]' a range of characters
#SELECT * FROM Customers WHERE City LIKE '[b-p]%';
#SELECT * FROM Customers WHERE City NOT LIKE '[b-p]%';

### **REGEXP**

Outside [ ] brackets--- ^ indicates begining of string. $ indicates end of string

Inside [ ] brackets --- ^ indicates not

In [ ]:
#1 Query the list of CITY names starting with vowels (i.e., a, e, i, o, or u) from STATION.
# Your result cannot contain duplicates.

#select distinct(CITY) from STATION where CITY regexp '^[aeiou]'

In [ ]:
#2  CITY names ending with vowels (a, e, i, o, u) from STATION

#select distinct(CITY) from STATION where CITY regexp '[aeiou]$'

In [ ]:
#3  CITY names from STATION which have vowels as both their first and last characters.

#select distinct(CITY) from STATION where CITY REGEXP '^[aeiou]' and CITY REGEXP '[aeiou]$'

In [ ]:
#4 CITY names from STATION that do not start with vowels

#select distinct(CITY) from STATION where CITY regexp '^[^aeiou]'

In [ ]:
#5 CITY names from STATION that do not end with vowels.

#select distinct(CITY) from STATION where CITY regexp '[^aeiou]$'

In [ ]:
#6  CITY names from STATION that either do not start with vowels or do not end with vowels.

#select distinct(CITY) from STATION where CITY regexp '^[^aeiou]' or CITY regexp '[^aeiou]$'

In [ ]:
#7 CITY names from STATION that do not start with vowels and do not end with vowels.

#select distinct(CITY ) from STATION where CITY regexp '^[^aeiou]' and CITY regexp '[^aeiou]$'

### And OR Not Operators

In [ ]:
# select col1, col2 from table_name where cond1 and cond2 and cond3;
#SELECT * FROM Customers WHERE Country='Germany' and City like 'B%' and 	ContactName like 'M%' ;

In [ ]:
# select col1, col2 from table_name where cond1 or cond2 or cond3;             
#SELECT * FROM Customers WHERE City='Berlin' or City='London' or City='Madrid';

In [ ]:
# select col1, col2 from table_name where not condition;
# SELECT * FROM Customers WHERE NOT Country='Germany';

In [ ]:
# key points

#'and' operator is applied b/w two different fields.
#'or' operator is applied on the same field.

## **Count, Avg, Sum, Max, Min**

In [ ]:
#The COUNT() function returns the number of records that matches a specified criterion.
#SELECT COUNT(*) as count FROM Products;
#SELECT COUNT(distinct unit) as no_of_unique_units FROM Products;
#SELECT COUNT(*) as count FROM Products where Price>10;

In [ ]:
#The AVG() function returns the average value of a numeric column.
#SELECT AVG(Price) as avg_price FROM Products;

In [ ]:
#The SUM() function returns the total sum of a numeric column.
#SELECT sum(Price) as total_price FROM Products.
#SELECT SUM(distinct Quantity) FROM OrderDetails;

In [ ]:
#The MIN() function returns the smallest value of the  numeric column.
#SELECT MIN(Price) AS SmallestPrice FROM Products;

In [ ]:
#The MAX() function returns the largest value of the  numeric column.
#SELECT MAX(Price) AS LargestPrice FROM Products;

## **Limit Clause**

In [ ]:
# it is used to select a limited number of records
# select * from table_name where condition  limit = number;
#SELECT * FROM Customers LIMIT 3;

## **Order By Clause**

In [ ]:
# select col1,col2 from table_name where cond orderby col1 asc, col2 desc;
#SELECT * FROM Customers where 	City like 'B%' ORDER BY Country ASC, CustomerName DESC;

In [ ]:
#it will first sort all the records in ascending order as per col1
#at a point where values of col1 nd col2 are same, records will be sorted in descending order as per col2.

### **Group By Clause**

In [ ]:
#The GROUP BY statement groups records that have the same values.
#it is often used with aggregate functions (COUNT, MAX, MIN, SUM, AVG).

In [ ]:
#SELECT Country, COUNT(*) as count FROM Customers where Country<> 'Germany'  GROUP BY Country ORDER BY COUNT(*) DESC;

In [ ]:
#####
# select   months*salary , count(*) from Employee group by months*salary order by(months*salary)  
#desc limit 1

### **Having Clause**

In [ ]:
#it is utilized as a conditional clause with Group By clause.
#it is added to SQL because where clause can't be combined with aggregate results.

#like SELECT Country, COUNT(*) as count FROM Customers where COUNT(*)>5  GROUP BY Country ORDER BY COUNT(*) DESC;      #this wouldn't work

In [ ]:
#SELECT Country, COUNT(*) as count FROM Customers  GROUP BY Country having COUNT(*)>5 ORDER BY COUNT(*) DESC;

In [ ]:
#SELECT Country, COUNT(*) as count FROM Customers  where Country<> 'Germany'  GROUP BY Country having COUNT(*)>5 ORDER BY COUNT(*) DESC limit 3;

In [ ]:
#select * from table_name
#where condition
#group by col
#having condition
#order by col
#limit 3

### **Alias**

### **Alias column syntex**

In [ ]:
# select col_name as alias_name from table_name

#select CustomerName as name concat(Address,' ',PostalCode,' ',City,' ',Country) as Address from Customers;

### **Alias table syntex**

In [ ]:
# select * from table_name as alias_name;

#select  o.OrderId, o.OrderDate, c.CustomerName from Customers as c, Orders as o where c.CustomerID= o.CustomerID  and c.CustomerName='sourav';

### **Comments**

### **Single line comment**

In [ ]:
#       select * from customers --where name='sourav';

### **Multi-line comment**

In [ ]:
#    /*select * from customers;
#    select * from shippers;
#    select * from orders;*/

### **Exists Operator**

In [ ]:
#The EXISTS operator returns true if the subquery returns one or more records.

In [ ]:
#The following SQL statement returns TRUE and lists the ProductName that has quantity =10
#SELECT ProductName  FROM Products as p WHERE exists (SELECT ProductID FROM OrderDetails as o  WHERE Quantity = 10 and p.ProductID=o.ProductID);


#alternate query for same result
#SELECT ProductName  FROM Products WHERE ProductID in (SELECT ProductID FROM OrderDetails WHERE Quantity = 10);

### **Any Operator**

In [ ]:
#The ANY operator returns true if any of the subquery values meet the condition.
#The following SQL statement returns TRUE and lists the product names if it finds ANY records in the OrderDetails table that quantity = 10

In [ ]:
#SELECT ProductName  FROM Products WHERE ProductID = ANY (SELECT ProductID FROM OrderDetails WHERE Quantity = 10);

### **All Operator**

In [ ]:
#The ALL operator returns true if all of the subquery values meet the condition.
#The following SQL statement returns TRUE and lists the product names 
#if ALL the records in the OrderDetails table has quantity = 10 
#(so, this example will return FALSE, because not ALL records in the OrderDetails table has quantity = 10)

In [ ]:
#SELECT ProductName FROM Products WHERE ProductID = ALL (SELECT ProductID FROM OrderDetails WHERE Quantity = 10);

### **Case Statement**

In [ ]:
#through conditions and returns a value when the first condition is met



# select OrderID, Quantity,
# case
# 	when Quantity >30 then 'quatity is greater than 30'
#     when Quantity = 30  then 'quantity is equals to 30'
#     else 'quantity is less than 30'
# end as Qunatity_text



# select CustomerName, City, Country from Customers
# order by 
# (case 
# 	when City is null then Country
#     else City
# end)

### **Nested Case Statement**

In [ ]:
#Type of Triangle

# select 
# (case 
#     when (A+B)>C and (B+C)>A and (C+A)>B then 
#         (case
#              when A=B and B=C and C=A then 'Equilateral'
#              when (A=B and B<>C) or (B=C and A<>C) or (C=A and B<>A) then 'Isosceles'
#              when A<>B and B<>C and C<>A then 'Scalene'                
#          end)
#     else  'Not A Triangle'        
# end ) 
# from TRIANGLES

### **Null functions**

In [ ]:
#it returns an alternative value if an expression is NULL:
#SELECT ProductName, UnitPrice * IFNULL(UnitsOnOrder, 0) FROM Products;

### **Null Values**

In [ ]:
# A field with a Null Value is a field with no value.

# A Null value is different from a zero value. A feild with a Null value is one that has been
# left blank during record creation.

In [ ]:
# How to test for Null values?

# Null values can't be test with comparison operator, such as =, <>.
# we will have to use the IS NULL/ IS NOT NULL operators instead.

In [ ]:
# select col1, col2 from table_name where col1 is null;
# select col1, col2 from table_name where col1 is not null;

### **Working with Dates**

In [ ]:
# SELECT * FROM Orders WHERE OrderDate='2008-11-11'